{
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "pad_id": 0,
  "bos_id": 0,
  "chunk_id": 0,
  "mask_id": 0,
  "attention_bias": false,
  "hidden_act": "silu",
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "max_position_embeddings": -1,
  "model_type": "llama",
  "num_attention_heads": 2,
  "num_hidden_layers": -1,
  "mask_probability": 0.15,
  "num_key_value_heads": 1,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.35.2",
  "use_cache": true,
  "vocab_size": 100,
  "output_hidden_states": "True",
  "hidden_dropout_prob":0.2,
  "chunk_topk": 8,
  "chunk_window": -1,
  "slide_window":512,
  "encoder_layers": 1,
  "decoder_layers": [1,1,1],
  "hcca_per_nlayers": 1,
  "enc_chunk_size":63,
  "dec_chunk_size":63,
  "chunk_causal_window": 16,
  "enable_alibi": true,
  "enable_causal_chunk_attn":true,
  "_flash_attn_2_enabled": false,
  "_triton_gca": true
}
